app/views/main/cartoon.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."user_id" WHERE "follows"."cartoon_id" = ?  [["cartoon_id", 980190962]]
---
			<h4>follower :</h4>
			<h4><%=@cartoon.users.count%></h4>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT 1 AS one FROM "cartoons" INNER JOIN "follows" ON "cartoons"."id" = "follows"."cartoon_id" WHERE "follows"."user_id" = ? AND "cartoons"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]
---
         <% if Current.user %>
		 	<% if Current.user.cartoons.include?(@cartoon) %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."chapter_id" = ?  [["chapter_id", 298486374]]
---
			<div class="p-2 bd-highlight"><%=time_ago_in_words(chapter.created_at)%></div>
			<div class="p-2 bd-highlight">comment:<%=chapter.comments.count%></div>