app/views/main/chapter.html.erb

  		<ul aria-labelledby="dropdownMenuButton1" class="dropdown-menu">
	    	<% @cartoon.chapters.each do |chapter| %>
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."cartoon_id" = ?  [["cartoon_id", 980190962]]

	</div>
	<% if @chapter.num != @cartoon.chapters.count %>
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."cartoon_id" = ? AND "chapters"."num" = ? LIMIT ?  [["cartoon_id", 980190962], ["num", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "chapters" WHERE "chapters"."cartoon_id" = ?  [["cartoon_id", 980190962]]