app/views/main/main.html.erb

SELECT "cartoons".* FROM "cartoons"
---
<div class="btn-group d-flex justify-content-center" role="group" aria-label="Basic example">
  <% Cartoon::DAY.each do |d| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."chapter_id" = ?  [["chapter_id", 298486374]]
---
        <td><%= time_ago_in_words(chapter.created_at) %></td>
        <td><%= chapter.comments.count %></td>