app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "chapter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["user_id", 980190962], ["chapter_id", 298486374], ["created_at", "2021-12-13 06:19:46.281335"], ["updated_at", "2021-12-13 06:19:46.281335"]]
---
  def create
    @comment = @chapter.comments.new(comment_params)
    @comment.user = Current.user
    @comment.save

SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."name" = ? LIMIT ?  [["name", "one"], ["LIMIT", 1]]
SELECT "chapters".* FROM "chapters" WHERE "chapters"."cartoon_id" = ? AND "chapters"."num" = ? LIMIT ?  [["cartoon_id", 980190962], ["num", 2], ["LIMIT", 1]]
---
  def set_chapter
    @cartoon=Cartoon.find_by(name:params[:name])
    @chapter=@cartoon.chapters.find_by(num:params[:num])