app/controllers/main_controller.rb

SELECT "cartoons".* FROM "cartoons"
SELECT COUNT(*) FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."user_id" WHERE "follows"."cartoon_id" = ?  [["cartoon_id", 980190962]]
SELECT "chapters".* FROM "chapters" ORDER BY created_at DESC
SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."daytoupdate" = ?  [["daytoupdate", "friday"]]
---
	def main
        @popular = Cartoon.all.sort{|a,b| b.users.count<=>a.users.count}.first(3)
		if Current.user
			@folltoon = Current.user.cartoons
		end
        @chapters = Chapter.all.order("created_at DESC")
        if params[:q]!= nil
            @daytoons = Cartoon.where(:daytoupdate => params[:q])

SELECT "genres".* FROM "genres"
SELECT "cartoons".* FROM "cartoons" WHERE ('comedy' = ANY(tags))
SELECT "cartoons".* FROM "cartoons"
---
    def genre
        @tags = Genre.all
		if params[:q]!= nil
            @cartoons = Cartoon.where( ['? = ANY(tags)', params[:q]])
        else
            @cartoons = Cartoon.all

SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."status" = ?  [["status", "complete"]]
SELECT "cartoons".* FROM "cartoons"
---
    def allcartoons
        if params[:sort]=="complete"
            @cartoons = Cartoon.where(:status => params[:sort])
        elsif params[:sort]=="continue"
            @cartoons = Cartoon.where(:status => params[:sort])
        elsif params[:sort]=="a-z"
            @cartoons = Cartoon.order("name ASC")
        elsif params[:sort]=="z-a"
            @cartoons = Cartoon.order("name DESC")
        else
            @cartoons = Cartoon.all

SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."name" = ? LIMIT ?  [["name", "one"], ["LIMIT", 1]]
SELECT "chapters".* FROM "chapters" WHERE "chapters"."cartoon_id" = ? ORDER BY "chapters"."created_at" DESC  [["cartoon_id", 980190962]]
---
    def cartoon
    	@cartoon=Cartoon.find_by(name:params[:name])
    	@chapters=@cartoon.chapters.order(created_at: :desc)

SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."name" = ? LIMIT ?  [["name", "one"], ["LIMIT", 1]]
SELECT "chapters".* FROM "chapters" WHERE "chapters"."cartoon_id" = ? AND "chapters"."num" = ? LIMIT ?  [["cartoon_id", 980190962], ["num", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."chapter_id" = ? ORDER BY created_at DESC  [["chapter_id", 980190962]]
---
    def chapter
    	@cartoon=Cartoon.find_by(name:params[:name])
    	@chapter=@cartoon.chapters.find_by(num:params[:chapter])
    	@comment=Comment.new
    	@comments=@chapter.comments.order("created_at DESC")

SELECT "cartoons".* FROM "cartoons" WHERE (name ILIKE'%t%')
---
    def search
    	@cartoons=Cartoon.where("name LIKE?","%" + params[:q] + "%")